#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_password.api_auth_token: Refreshing state... [id=none]
data.archive_file.lambda_package: Reading...
data.aws_iam_policy_document.lambda_permissions: Reading...
data.aws_iam_policy_document.lambda_logging: Reading...
data.aws_route53_zone.domain: Reading...
data.aws_iam_policy_document.lambda: Reading...
aws_dynamodb_table.matching_table: Refreshing state... [id=chrred-link-shortener-test-link-matching]
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=2399027458]
data.aws_iam_policy_document.lambda: Read complete after 0s [id=3693445097]
aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::757214766189:policy/chrred-link-shortener-test-lambda-permissions]
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=1779473963]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::757214766189:policy/chrred-link-shortener-test-lambda-logging]
aws_iam_role.lambda: Refreshing state... [id=chrred-link-shortener-test-lambda]
aws_acm_certificate.public_domain: Refreshing state... [id=arn:aws:acm:us-east-1:757214766189:certificate/67c6f555-de6c-4477-9538-291b3951e794]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=chrred-link-shortener-test-lambda-20230423112019860300000002]
aws_iam_role_policy_attachment.lambda: Refreshing state... [id=chrred-link-shortener-test-lambda-20230423112019855600000001]
data.aws_route53_zone.domain: Read complete after 1s [id=Z00139661AMAXF6LLDC28]
aws_route53_record.public_domain["test.chr.red"]: Refreshing state... [id=Z00139661AMAXF6LLDC28__f3223d821cda46ca8a7226e39036d050.test.chr.red._CNAME]
aws_acm_certificate_validation.public_domain: Refreshing state... [id=2023-04-23 11:20:36.537 +0000 UTC]
data.archive_file.lambda_package: Read complete after 2s [id=177aef9c7ecdc343d3946510c9df9a190a2ab3d2]
aws_lambda_function.monolith: Refreshing state... [id=chrred-link-shortener-test-monolith]
aws_api_gateway_domain_name.stack_root_domain: Refreshing state... [id=test.chr.red]
aws_route53_record.root_domain_mapping: Refreshing state... [id=Z00139661AMAXF6LLDC28_test.chr.red_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_lambda_function.monolith will be updated in-place
  ~ resource "aws_lambda_function" "monolith" {
        id                             = "chrred-link-shortener-test-monolith"
      ~ last_modified                  = "2023-06-02T17:44:53.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:757214766189:function:chrred-link-shortener-test-monolith:91" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:757214766189:function:chrred-link-shortener-test-monolith:91/invocations" -> (known after apply)
      ~ source_code_hash               = "QW+C2fjyOx4o1uStsGsDy6ujVGP5AmDtp1/F7zLAYaU=" -> "tePL7qSjV3VqszfGT5GKbIP9trIJvcKaAwoTaFGR/ks="
        tags                           = {}
      ~ version                        = "91" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Warning: Failed to decode resource from state

Error decoding "aws_api_gateway_rest_api.monolith" from prior state: a number
is required
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Workflow: `Deployment`*